backend-api/app/Controllers/Api/Auth.php

    public function login()
    {
        $input    = $this->request->getJSON(true);
        $username = $input['username'] ?? $this->request->getVar('username');
        $password = $input['password'] ?? $this->request->getVar('password');

        $model = new UserModel();
        $user  = $model->where('username', $username)
                       ->orWhere('useremail', $username)
                       ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin@elibrary.com'
OR `useremail` = 'admin@elibrary.com'
 LIMIT 1