backend-api/app/Controllers/Api/Buku.php

SELECT *
FROM `buku`
---
    public function index()
    {
        $model = new BukuModel();
        $data  = $model->findAll();

SELECT *
FROM `buku`
WHERE `buku`.`id` = '1'
---
    public function show($id = null)
    {
        $model = new BukuModel();
        $data  = $model->find($id);

SELECT *
FROM `buku`
WHERE `buku`.`id` = '3'
---
    public function update($id = null)
    {
        $model = new BukuModel();
        if (!$model->find($id)) {
            return $this->failNotFound('Buku tidak ditemukan');
        }

        // Cek apakah ada file upload baru
        $cover    = null;
        $file     = $this->request->getFile('cover');
        $existing = $model->find($id);