backend-api/app/Controllers/Api/Kategori.php

    public function index()
    {
        $model = new KategoriModel();
        $data  = $model->findAll();
---
SELECT *
FROM `kategori`

    public function create()
    {
        $input = $this->request->getJSON(true);
        $model = new KategoriModel();
        if ($model->insert($input)) {
---
INSERT INTO `kategori` (`nama_kategori`, `deskripsi`) VALUES ('Fiksi', 'Novel dan cerita fiksi')