backend-api/app/Controllers/Api/Peminjaman.php

    public function index()
    {
        $model = new PeminjamanModel();
        $data  = $model->findAll();
---
SELECT *
FROM `peminjaman`